# функція, яка перевіряє, чи є у гравця доступні ходи
# приймає 1 аргумент:
#   field               ігрове поле у вигляді двовимірного списку (матриця 4х4)

# алгоритм перевірки комірок схематично показано на зображенні check_moves.jpeg

def check_moves(field):
    # пробігаємось по ігровому полю по координатах
    for i in range(0, 4):
        for j in range(0, 4):
            # перевіряємо поточну комірку
            # якщо вона == 0 (пуста), виходимо з функції, і повертаємо значення True (у гравця є доступні ходи)
            if field[i][j] == 0:
                return True

            # перевіряємо, чи це не останній рядок
            if i <= 2:
                # якщо не останній, перевіряємо чи це не остання комірка в рядку
                if j <= 2:
                    # якщо не остання, перевіряємо сусідні комірки справа і внизу
                    # якщо значення в правій чи нижній комірці == значенню в поточній комірці,
                    # значить ми можемо їх скласти
                    # тому виходимо з функції, і повертаємо значення True (у гравця є доступні ходи)
                    if field[i][j] == field[i][j + 1] or field[i][j] == field[i + 1][j]:
                        return True
                else:
                    # якщо це остання комірка в рядку, то перевіряємо лише нижню комірку,
                    # бо справа сусідніх комірок немає
                    if field[i][j] == field[i + 1][j]:
                        return True     # виходимо з функції, і повертаємо значення True (у гравця є доступні ходи)
            else:
                # якщо це останній рядок, то перевіряємо чи це не остання комірка в рядку
                if j <= 2:
                    # якщо комірка не остання, то перевіряємо лише праву комірку,
                    # бо внизу сусідніх комірок немає
                    if field[i][j] == field[i][j + 1]:
                        return True     # виходимо з функції, і повертаємо значення True (у гравця є доступні ходи)

            # перевіряємо найнижчу праву комірку
            # якщо вона пуста, виходимо з функції, і повертаємо значення True (у гравця є доступні ходи)
            if field[3][3] == 0:
                return True

    # якщо жодна з попередніх перевірок не пройшла, значить у гравця немає доступних ходів
    # тому виходимо з функції, і повертаємо значення False (у гравця немає доступних ходів)
    return False
