# функція прораховує зміну поля після ходу гравця
# приймає 3 аргументи:
#   direction           хід гравця (вверх, вниз, вліво, вправо)
#   field               ігрове поле у вигляді двовимірного списку (матриця 4х4)
#   score               рахунок гравця (ціле число)

# АЛГОРИТМ ПЕРЕВІРКИ:
#                               яку кнопку натиснув гравець, в ту сторону мають зміститися числа
#        0  1  2  3             наприклад, якщо гравець натиснув кнопку вверх, числа в нульвому рядку ми
#        ----------             змістити вверх не зможемо, тому початковий рядок буде мати індекс 1, наступний рядок
#   0 |  0  0  0  0             буде мати індекс 2 (+1), а останній 3, тобто під час перевірки ми завжди рухаємося в
#   1 |  2  0  0  0             зворотньому напрямку
#   2 |  0  0  0  0             якщо гравець натиснув кнопку вниз, то початковий рядок буде мати індекс 2
#   3 |  2  0  0  0             наступний – 1 (-1), а останній – 0.
#
#                               у випадку вліво/вправо перевірка буде йти по стовпцях, а не рядках, але логіка
#                               така сама:
#                                   якщо гравець натиснув вліво, індекс почтакового стовпця буде 1
#                                   наступного – 2 (+1), останнього – 3
#
#                                   якщо гравець натиснув вправо, індекс почтакового стовпця буде 2
#                                   наступного – 1 (-1), останнього – 0
#
#                               до того ж, кожен наступний рядок/стовпець робить свою перевірку + повторює всі попередні
#                               для прикладу візьмемо один рядок 0 2 2 4, який має стати 8 0 0 0, за умови, що гравець
#                               натиснув вліво
#                               згідно інформації вище, індекс початкового стовпця - 1, наступного - 2, останнього - 3
#                               1. перевіримо елемент[0][1] (цифра 2) і елемент[0][0] (цифра 0)
#                                  оскільки 2 > 0, зміщуємо 2 вліво, і тепер елемент[0][0] == 2, а елемент[0][1] == 0
#                                  тепер рядок має такий вигляд: 2 0 2 4
#                               2. рухаємось далі, індекс початкового стовпця - 2, наступного - 3, останнього - 3
#                                  перевіримо елемент[0][2] (цифра 2) і елемент[0][1] (цифра 0)
#                                  2 > 0, зміщуємо 2 вліво, елемент[0][1] == 2, елемент[0][2] == 0, рядок -> 2 2 0 4
#
#                               3. тепер нам знову треба перевірити елементи з кроку 1:
#                                   [0][1] (цифра 2) і елемент[0][0] (цифра 2)
#                                   оскільки 2 == 2, до елемента[0][0] додаємо елемент[0][1]
#                                   тепер елемент[0][0] == 4, елемент[0][1] == 0, рядок -> 4 0 0 4
#                               4. рухаємось далі, індекс початкового стовпця - 3, останнього - 3
#                                  оскільки індекс початкового стовпця == індексу останнього,
#                                  значить ми дійшли до кінця
#                                  перевіримо елемент[0][3] (цифра 4) і елемент[0][2] (цифра 0)
#                                  оскільки 4 > 0, зміщуємо 4 вліво, і тепер елемент[0][2] == 4, а елемент[0][3] == 0
#                                  рядок -> 4 0 4 0
#                               5. перевіримо елемент[0][3] (цифра 4) і елемент[0][1] (цифра 0)
#                                  оскільки 4 > 0, зміщуємо 4 вліво, і тепер елемент[0][1] == 4, а елемент[0][2] == 0
#                                  рядок -> 4 4 0 0
#                               6. перевіримо елемент[0][1] (цифра 4) і елемент[0][0] (цифра 4)
#                                  оскільки 4 == 4, до елемента[0][0] додаємо елемент[0][1]
#                                  тепер елемент[0][0] == 8, елемент[0][1] == 0, рядок -> 8 0 0 0
#
#                               повний цикл перевірки одного рядка/стовпця:
#                                   0 2 2 4 -> 2 0 2 4 -> 2 2 0 4 -> 4 0 0 4 -> 4 0 4 0 -> 4 4 0 0 -> 8 0 0 0


def move(direction, field, score):
    # start_position    індекс початкового рядка/стовпця
    # out_of_bounds     індекс рядка/стовпця за межами ігрового поля
    # end_index         індех останнього рядка/стовпця
    # next_index        індекс наступного рядка/стовпця буде меншим на 1 (вниз*вправо), або більшим на 1 (вверх/вліво)

    if direction == 'down' or direction == 'right':
        start_position = 2
        out_of_bounds = -1
        end_index = 3
        next_index = 1
    else:
        start_position = 1
        out_of_bounds = 4
        end_index = 0
        next_index = -1

    is_moved = False    # змінилося поле чи ні
    is_won = False      # чи зібрав гравець 2048

    while (direction in ['left', 'up'] and start_position < out_of_bounds) or (
            direction in ['right', 'down'] and start_position > out_of_bounds):
        i = start_position
        while (direction in ['left', 'up'] and i > end_index) or (direction in ['right', 'down'] and i < end_index):
            j = 0
            if direction in ['up', 'down']:
                x1, x2 = (i + next_index, i)    # якщо вверх/вниз, спочатку рухаємось по рядках, а потім по стовпцях
            else:  # left, right
                y1, y2 = (i + next_index, i)    # якщо вліво/вправо, спочатку рухаємось по стовпцях, а потім по рядках

            while j <= 3:
                if direction in ['up', 'down']:
                    y1, y2 = (j, j)             # якщо вверх/вниз, спочатку рухаємось по рядках, а потім по стовпцях
                else:  # left, right
                    x1, x2 = (j, j)             # якщо вліво/вправо, спочатку рухаємось по стовпцях, а потім по рядках

                # якщо елемент, в сторону якого відбувається зміщення == 0, а інший > 0, то робимо зміщення
                if field[x1][y1] == 0 and field[x2][y2] > 0:
                    field[x1][y1] = field[x2][y2]
                    field[x2][y2] = 0
                    is_moved = True

                # якщо елемент, в сторону якого відбувається зміщення == іншому елементу,
                # і вони не == 0, то робимо зміщення (якщо два елементи == 0, то робити зміщення немає сенсу)
                elif field[x1][y1] == field[x2][y2] and (field[x1][y1] + field[x2][y2]) != 0:
                    field[x1][y1] += field[x2][y2]
                    field[x2][y2] = 0
                    score += field[x1][y1]      # додаємо суму до загального рахунку
                    is_moved = True

                    if field[x1][y1] == 2048:   # якщо гравець зібрав 2048, вказуємо, що він виграв
                        is_won = True

                j += 1

            i += next_index

        start_position -= next_index

    return is_won, score, is_moved
