# функція, яка виводить в консоль ігрове поле і рахунок гравця
# приймає 2 аргументи:
#   field   ігрове поле
#   score   рахунок гравця

# ВИГЛЯД ІГРОВОГО ПОЛЯ
#
#       Ваш рахунок: 0
# -----------------------------
# |      |      |      |      |
# |      |      |  2   |      |
# |      |      |      |      |
# -----------------------------
# |      |      |      |      |
# |      |      |      |      |
# |      |      |      |      |
# -----------------------------
# |      |      |      |      |
# |      |      |      |      |
# |      |      |      |      |
# -----------------------------
# |      |      |      |      |
# |      |  2   |      |      |
# |      |      |      |      |
# -----------------------------

def fprint(field: list, score: int):

    print(f"\n\n      Ваш рахунок: {score}")

    # Змінні, які формують верх, середину і низ ігрового поля
    field_top = "-----------------------------\n|      |      |      |      |"
    field_middle = "|      |      |      |      |\n-----------------------------\n|      |      |      |      |"
    field_bottom = "|      |      |      |      |\n-----------------------------"
    # Змінна, в яку записується всі рядки з числами
    rows = []

    # пробігаємось по кожному рядку ігрового поля (кожен його рядок – це ще один список)
    for row in field:
        # створюємо пустий список, в якому будуть записані всі елементи рядка
        tmp_list = []
        # пробігаємось по кожному елементу в рядку
        for item in row:
            item_length = len(str(item))    # довжина числа
            before_spaces = ' '             # кількість пробілів перед числом (мінімамльна кількість)
            after_spaces = ' '              # кількість пробілів після числа (мінімамльна кількість)

            if item_length < 3:             # якщо довжина числа менше 3, то пробілів перед числом має бути 2
                before_spaces *= 2

            if item_length == 1:            # якщо довжина числа 1, то пробілів після числа має бути 3
                after_spaces *= 3
            elif item_length < 4:           # якщо довжина числа менше 4, то пробілів після числа має бути 2
                after_spaces *= 2

            if item == 0:                   # якщо число == 0, то замість 0 виводимо на екран пробіл
                item = ' '
            else:                           # в усіх інших випадках переводимо число в стрічку
                item = str(item)

            # додаємо в тимчасовий список кінцевий варіант елемента, який буде виводитись на екран
            # наприклад для числа 64 – це буде 3 пробіли на початку, саме 64, і 2 пробіли в кінці, тобто "   64  "
            tmp_list.append(before_spaces + item + after_spaces)

        # коли пробіглися по всіх елементах рядка, додаємо в список rows список tmp_list,
        # який містить всі елементи рядка в відформатованому вигляді
        rows.append(tmp_list)

    # виводимо в консоль ігрове поле
    for i in range(4):                  # пробігаємось по кожному рядку
        if i == 0:                      # якщо це перший рядок, то виводимо верхню частину поля
            print(field_top)

        # виводимо в консоль сам рядок
        print(f"|{rows[i][0]}|{rows[i][1]}|{rows[i][2]}|{rows[i][3]}|")

        if i == 3:                      # якщо це останній рядок, то виводимо нижню частину поля
            print(field_bottom)
        else:                           # в інакшому разі, виводимо середню частину поля
            print(field_middle)
